## Data Preparation
- The purpose is to learn about data preparation functions in R and practice using the functions learned by completing a data preparation task

### Load data

In [1]:
load('./L2-data/2-DataPrep.RData')

### Display data

In [2]:
storms

  storm   wind pressure date
1 Alberto 110  1007     2000-08-03
2 Alex     45  1009     1998-07-27
3 Allison  65  1005     1995-06-03
4 Ana      40  1013     1997-06-30
5 Arlene   50  1010     1999-06-11
6 Arthur   45  1010     1996-06-17

In [3]:
cases

  country 2011  2012  2013
1 FR       7000  6900  7000
2 DE       5800  6000  6200
3 US      15000 14000 13000

In [4]:
pollution

  city     size  amount
1 New York large  23
2 New York small  14
3 London   large  22
4 London   small  16
5 Beijing  large 121
6 Beijing  small  56

In [5]:
head(tb) # display a few of top rows for large dataset

  country     year sex    child adult elderly
1 Afghanistan 1995 female NA    NA    NA
2 Afghanistan 1995 male   NA    NA    NA
3 Afghanistan 1996 female NA    NA    NA
4 Afghanistan 1996 male   NA    NA    NA
5 Afghanistan 1997 female  5    96     1
6 Afghanistan 1997 male    0    26     0

### Install packages

In [6]:
packages <- c('tidyr', 'dplyr')
install.packages(packages)
library(tidyr)
library(dplyr)

The downloaded binary packages are in
	/var/folders/71/32h8kjzx1d957cbl0_xhpyvr0000gn/T//RtmpgnlVvd/downloaded_packages

Attaching package: ‘dplyr’


The following object is masked _by_ ‘.GlobalEnv’:

    storms


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

### Data Preparation Tasks

### Reshaping table

In [7]:
gather(cases, 'year', 'n', 2:4) # melt column 2,3,4

  country year n
1 FR      2011  7000
2 DE      2011  5800
3 US      2011 15000
4 FR      2012  6900
5 DE      2012  6000
6 US      2012 14000
7 FR      2013  7000
8 DE      2013  6200
9 US      2013 13000

In [8]:
spread(pollution, size, amount) # pivot table using size as column and amount as value

  city     large small
1 Beijing  121   56
2 London    22   16
3 New York  23   14

### Reshaping column

In [9]:
storms2 <- separate(storms, date, c('year', 'month', 'date'), sep='-') # split date string
storms2

  storm   wind pressure year month date
1 Alberto 110  1007     2000 08    03
2 Alex     45  1009     1998 07    27
3 Allison  65  1005     1995 06    03
4 Ana      40  1013     1997 06    30
5 Arlene   50  1010     1999 06    11
6 Arthur   45  1010     1996 06    17

In [10]:
unite(storms2, "date", date, month, year, sep="-") # combine date parts

  storm   wind pressure date
1 Alberto 110  1007     03-08-2000
2 Alex     45  1009     27-07-1998
3 Allison  65  1005     03-06-1995
4 Ana      40  1013     30-06-1997
5 Arlene   50  1010     11-06-1999
6 Arthur   45  1010     17-06-1996

### Subsetting columns

In [11]:
select(storms, storm, pressure, date) # select columns

  storm   pressure date
1 Alberto 1007     2000-08-03
2 Alex    1009     1998-07-27
3 Allison 1005     1995-06-03
4 Ana     1013     1997-06-30
5 Arlene  1010     1999-06-11
6 Arthur  1010     1996-06-17

In [12]:
select(storms, -wind) # select all columns but wind

  storm   pressure date
1 Alberto 1007     2000-08-03
2 Alex    1009     1998-07-27
3 Allison 1005     1995-06-03
4 Ana     1013     1997-06-30
5 Arlene  1010     1999-06-11
6 Arthur  1010     1996-06-17

In [13]:
select(storms, 1:3) # select column 1, 2, 3

  storm   wind pressure
1 Alberto 110  1007
2 Alex     45  1009
3 Allison  65  1005
4 Ana      40  1013
5 Arlene   50  1010
6 Arthur   45  1010

In [14]:
select(storms, storm:pressure) # select column storm, pressure and all in between

  storm   wind pressure
1 Alberto 110  1007
2 Alex     45  1009
3 Allison  65  1005
4 Ana      40  1013
5 Arlene   50  1010
6 Arthur   45  1010

In [15]:
select(storms, ends_with('e')) # select column whose name end with e

  pressure date
1 1007     2000-08-03
2 1009     1998-07-27
3 1005     1995-06-03
4 1013     1997-06-30
5 1010     1999-06-11
6 1010     1996-06-17

### Subsetting rows

In [16]:
filter(storms, wind >= 50)

  storm   wind pressure date
1 Alberto 110  1007     2000-08-03
2 Allison  65  1005     1995-06-03
3 Arlene   50  1010     1999-06-11

In [17]:
filter(storms, wind >= 50, storm %in% c('Arlene', 'Allison')) # multiple conditions joined by and

  storm   wind pressure date
1 Allison 65   1005     1995-06-03
2 Arlene  50   1010     1999-06-11

In [18]:
filter(storms, wind >= 50 | storm %in% c('Ana', 'Arthur')) # filter by wind or storm name

  storm   wind pressure date
1 Alberto 110  1007     2000-08-03
2 Allison  65  1005     1995-06-03
3 Ana      40  1013     1997-06-30
4 Arlene   50  1010     1999-06-11
5 Arthur   45  1010     1996-06-17

### Make new variables

In [19]:
mutate(storms, ratio=pressure / wind, inverse=ratio ^ -1)

  storm   wind pressure date       ratio     inverse
1 Alberto 110  1007     2000-08-03  9.154545 0.10923535
2 Alex     45  1009     1998-07-27 22.422222 0.04459861
3 Allison  65  1005     1995-06-03 15.461538 0.06467662
4 Ana      40  1013     1997-06-30 25.325000 0.03948667
5 Arlene   50  1010     1999-06-11 20.200000 0.04950495
6 Arthur   45  1010     1996-06-17 22.444444 0.04455446

In [20]:
# find cumulative minimum of pressure and element-wise maximum between pressure and the cummulative minimum
mutate(storms, cum_min=cummin(pressure), p_max=pmax(pressure, cum_min))

  storm   wind pressure date       cum_min p_max
1 Alberto 110  1007     2000-08-03 1007    1007
2 Alex     45  1009     1998-07-27 1007    1009
3 Allison  65  1005     1995-06-03 1005    1005
4 Ana      40  1013     1997-06-30 1005    1013
5 Arlene   50  1010     1999-06-11 1005    1010
6 Arthur   45  1010     1996-06-17 1005    1010

In [21]:
mutate(storms, tile=ntile(pressure, n=4)) # group presssure into near equally sized 4 groups

  storm   wind pressure date       tile
1 Alberto 110  1007     2000-08-03 1
2 Alex     45  1009     1998-07-27 2
3 Allison  65  1005     1995-06-03 1
4 Ana      40  1013     1997-06-30 4
5 Arlene   50  1010     1999-06-11 2
6 Arthur   45  1010     1996-06-17 3

In [22]:
mutate(storms, lag_p=lag(pressure)) # create new pressure column shifted down one row

  storm   wind pressure date       lag_p
1 Alberto 110  1007     2000-08-03   NA
2 Alex     45  1009     1998-07-27 1007
3 Allison  65  1005     1995-06-03 1009
4 Ana      40  1013     1997-06-30 1005
5 Arlene   50  1010     1999-06-11 1013
6 Arthur   45  1010     1996-06-17 1010

In [23]:
# create new flag column giving TRUE for pressure between 1000 and 1010
mutate(storms, is_between=between(pressure, 1000, 1010))

  storm   wind pressure date       is_between
1 Alberto 110  1007     2000-08-03  TRUE
2 Alex     45  1009     1998-07-27  TRUE
3 Allison  65  1005     1995-06-03  TRUE
4 Ana      40  1013     1997-06-30 FALSE
5 Arlene   50  1010     1999-06-11  TRUE
6 Arthur   45  1010     1996-06-17  TRUE

In [24]:
# create new column denoting proportion of rows with pressure value not exceeding current row pressure
mutate(storms, cum_d=cume_dist(pressure))

  storm   wind pressure date       cum_d
1 Alberto 110  1007     2000-08-03 0.3333333
2 Alex     45  1009     1998-07-27 0.5000000
3 Allison  65  1005     1995-06-03 0.1666667
4 Ana      40  1013     1997-06-30 1.0000000
5 Arlene   50  1010     1999-06-11 0.8333333
6 Arthur   45  1010     1996-06-17 0.8333333

### Summarise data

In [25]:
# compute mean, variace, no. of observation of all time cases 
cases %>% gather('year', 'n', 2:4) %>% summarise(mean=mean(n), variance=var(n), n=n())

  mean     variance n
1 8988.889 14561111 9

### Sort data

In [26]:
arrange(pollution, desc(amount)) # sort data by pollution amount descendingly

  city     size  amount
1 Beijing  large 121
2 Beijing  small  56
3 New York large  23
4 London   large  22
5 London   small  16
6 New York small  14

### Group data

In [27]:
# group data by city then compute group mean and maximum polution
agg_poll <- pollution %>% group_by(city) %>% summarise(mean=mean(amount), max=max(amount))
agg_poll

  city     mean max
1 Beijing  88.5 121
2 London   19.0  22
3 New York 18.5  23

### Join

In [28]:
# sort data by pollution amount then left join with aggregated pollution data above
pollution %>% arrange(amount) %>% left_join(agg_poll, by='city')

  city     size  amount mean max
1 New York small  14    18.5  23
2 London   small  16    19.0  22
3 London   large  22    19.0  22
4 New York large  23    18.5  23
5 Beijing  small  56    88.5 121
6 Beijing  large 121    88.5 121

## Data preparation task
- what is the average arrival delay of airlines ?
- what airline is the worst in terms of average arrival delay ?

### Load data

In [29]:
flights_data <- read.csv('L2-data/flights.csv')
airlines_data <- read.csv('L2-data/airlines.csv')

In [30]:
head(flights_data)

  X year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1 1 2013 1     1   517      515             2         830      819
2 2 2013 1     1   533      529             4         850      830
3 3 2013 1     1   542      540             2         923      850
4 4 2013 1     1   544      545            -1        1004     1022
5 5 2013 1     1   554      600            -6         812      837
6 6 2013 1     1   554      558            -4         740      728
  arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  11       UA      1545   N14228  EWR    IAH  227      1400     5    15
2  20       UA      1714   N24211  LGA    IAH  227      1416     5    29
3  33       AA      1141   N619AA  JFK    MIA  160      1089     5    40
4 -18       B6       725   N804JB  JFK    BQN  183      1576     5    45
5 -25       DL       461   N668DN  LGA    ATL  116       762     6     0
6  12       UA      1696   N39463  EWR    ORD  150       719     5    58
  time_hour
1 2013-01-01 05:00:00
2 2013-01-01 05:00:00
3 2013-01-01 05:00:00
4 2013-01-01 05:00:00
5 2013-01-01 06:00:00
6 2013-01-01 05:00:00

In [31]:
head(airlines_data)

  X carrier name
1 1 9E      Endeavor Air Inc.
2 2 AA      American Airlines Inc.
3 3 AS      Alaska Airlines Inc.
4 4 B6      JetBlue Airways
5 5 DL      Delta Air Lines Inc.
6 6 EV      ExpressJet Airlines Inc.

### Subset columns
- select `arr_delay`, `carrier` which are relevant columns

In [32]:
flights_select <- select(flights_data, arr_delay, carrier)
head(flights_select)

  arr_delay carrier
1  11       UA
2  20       UA
3  33       AA
4 -18       B6
5 -25       DL
6  12       UA

### Filter rows
- deselect flights with NA in arrival delay
- deselect flights arriving on time or earlier than scheduled time

In [33]:
flights_select <- filter(flights_select, !is.na(arr_delay) & arr_delay > 0)
head(flights_select)

  arr_delay carrier
1 11        UA
2 20        UA
3 33        AA
4 12        UA
5 19        B6
6  8        AA

### Compute mean delay
- group data by carrier and calculate group mean of arrival delay

In [34]:
mean_arr_delay <- group_by(flights_select, carrier) %>% summarise(mean_delay=mean(arr_delay))
mean_arr_delay

   carrier mean_delay
1  9E      49.27271
2  AA      38.26555
3  AS      34.36508
4  B6      40.00906
5  DL      37.74356
6  EV      48.26858
7  F9      47.57908
8  FL      41.09446
9  HA      35.03093
10 MQ      37.85205
11 OO      60.60000
12 UA      36.65098
13 US      29.01157
14 VX      43.84708
15 WN      40.74755
16 YV      51.08140

### Sort data
- descendingly sort mean arrival delay of aggregated data

In [35]:
mean_arr_delay <- arrange(mean_arr_delay, desc(mean_delay))
mean_arr_delay

   carrier mean_delay
1  OO      60.60000
2  YV      51.08140
3  9E      49.27271
4  EV      48.26858
5  F9      47.57908
6  VX      43.84708
7  FL      41.09446
8  WN      40.74755
9  B6      40.00906
10 AA      38.26555
11 MQ      37.85205
12 DL      37.74356
13 UA      36.65098
14 HA      35.03093
15 AS      34.36508
16 US      29.01157

### Join data
- join aggregated data with `airlines` table to get more information

In [36]:
joined <- left_join(mean_arr_delay, select(airlines_data, -X), by='carrier')
joined

   carrier mean_delay name
1  OO      60.60000   SkyWest Airlines Inc.
2  YV      51.08140   Mesa Airlines Inc.
3  9E      49.27271   Endeavor Air Inc.
4  EV      48.26858   ExpressJet Airlines Inc.
5  F9      47.57908   Frontier Airlines Inc.
6  VX      43.84708   Virgin America
7  FL      41.09446   AirTran Airways Corporation
8  WN      40.74755   Southwest Airlines Co.
9  B6      40.00906   JetBlue Airways
10 AA      38.26555   American Airlines Inc.
11 MQ      37.85205   Envoy Air
12 DL      37.74356   Delta Air Lines Inc.
13 UA      36.65098   United Air Lines Inc.
14 HA      35.03093   Hawaiian Airlines Inc.
15 AS      34.36508   Alaska Airlines Inc.
16 US      29.01157   US Airways Inc.

### Pipeline
- combine all the data preparation steps into one

In [37]:
flights_data %>% 
select(carrier, arr_delay) %>%
filter(!is.na(arr_delay) & arr_delay > 0) %>%
group_by(carrier) %>%
summarise(mean_delay=mean(arr_delay)) %>%
arrange(desc(mean_delay)) %>%
left_join(select(airlines_data, -X), by='carrier')

   carrier mean_delay name
1  OO      60.60000   SkyWest Airlines Inc.
2  YV      51.08140   Mesa Airlines Inc.
3  9E      49.27271   Endeavor Air Inc.
4  EV      48.26858   ExpressJet Airlines Inc.
5  F9      47.57908   Frontier Airlines Inc.
6  VX      43.84708   Virgin America
7  FL      41.09446   AirTran Airways Corporation
8  WN      40.74755   Southwest Airlines Co.
9  B6      40.00906   JetBlue Airways
10 AA      38.26555   American Airlines Inc.
11 MQ      37.85205   Envoy Air
12 DL      37.74356   Delta Air Lines Inc.
13 UA      36.65098   United Air Lines Inc.
14 HA      35.03093   Hawaiian Airlines Inc.
15 AS      34.36508   Alaska Airlines Inc.
16 US      29.01157   US Airways Inc.

### Conclusion
- on average, US Airways is least delaying airline on arrival 
- SkyWest Airlines is the worst airline in terms of mean arrival delay
- mean arrival delay of SkyWest Airlines (the worst) is double of US Airways (the best)